abstract class DoctorsProfileMethods {
  static final List<String> _allSlots = [
    "12:00 AM",
    "12:30 AM",
    "01:00 AM",
    "01:30 AM",
    "02:00 AM",
    "02:30 AM",
    "03:00 AM",
    "03:30 AM",
    "04:00 AM",
    "04:30 AM",
    "05:00 AM",
    "05:30 AM",
    "06:00 AM",
    "06:30 AM",
    "07:00 AM",
    "07:30 AM",
    "08:00 AM",
    "08:30 AM",
    "09:00 AM",
    "09:30 AM",
    "10:00 AM",
    "10:30 AM",
    "11:00 AM",
    "11:30 AM",
    "12:00 PM",
    "12:30 PM",
    "01:00 PM",
    "01:30 PM",
    "02:00 PM",
    "02:30 PM",
    "03:00 PM",
    "03:30 PM",
    "04:00 PM",
    "04:30 PM",
    "05:00 PM",
    "05:30 PM",
    "06:00 PM",
    "06:30 PM",
    "07:00 PM",
    "07:30 PM",
    "08:00 PM",
    "08:30 PM",
    "09:00 PM",
    "09:30 PM",
    "10:00 PM",
    "10:30 PM",
    "11:00 PM",
    "11:30 PM"
  ];
  static final Map<dynamic, dynamic> _cities = {
    "سوهاج": [
      "سوهاج",
      "أخميم",
      "البلينا",
      "جرجا",
      "دار السلام",
      "ساقلتة",
      "طما",
      "طهطا",
      "المراغة",
      "المنشاة",
      "العسيرات",
      "جهينة"
    ],
    "أسيوط": [
      "أسيوط",
      "ديروط",
      "القوصية",
      "منفلوط",
      "أبو تيج",
      "صدفا",
      "الغنايم",
      "البداري",
      "ساحل سليم"
    ],
    "المنيا": [
      "المنيا",
      "سمالوط",
      "مطاي",
      "بني مزار",
      "مغاغة",
      "العدوة",
      "دير مواس",
      "ملوي",
      "أبو قرقاص"
    ],
    "قنا": [
      "قنا",
      "أبوتشت",
      "فرشوط",
      "نجع حمادي",
      "الوقف",
      "دشنا",
      "قفط",
      "قوص",
      "نقادة"
    ],
    "الأقصر": [
      "الأقصر",
      "أرمنت",
      "إسنا",
      "الزينية",
      "الطود",
      "البياضية",
      "القرنة"
    ],
    "أسوان": ["أسوان", "دراو", "كوم أمبو", "نصر النوبة", "إدفو"],
    "بني سويف": [
      "بني سويف",
      "ناصر",
      "الواسطى",
      "إهناسيا",
      "ببا",
      "الفشن",
      "سمسطا"
    ],
    "الفيوم": ["الفيوم", "سنورس", "إبشواي", "طامية", "يوسف الصديق", "أطسا"],
    "الوادي الجديد": ["الخارجة", "الداخلة", "بلاط", "الفرافرة", "باريس"],
    "محافظة البحر الأحمر": [
      "راس غرب",
      "الغردقه",
      "القصير",
      "سفاجا",
      "مرسى علم وبرنيس والحسن الشازلى",
      "مدينة حلايب"
    ],
    "القاهرة": [
      "مصر الجديدة",
      "مدينة نصر",
      "المعادي",
      "حلوان",
      "المطرية",
      "شبرا",
      "السيدة زينب",
      "الجمالية",
      "البساتين",
      "دار السلام",
      "عين شمس",
      "المرج",
      "الزاوية الحمراء",
      "روض الفرج",
      "وسط القاهرة",
      "المقطم"
    ],
    "الجيزة": [
      "الدقي",
      "العجوزة",
      "المهندسين",
      "الهرم",
      "بولاق الدكرور",
      "العمرانية",
      "الوراق",
      "إمبابة",
      "العياط",
      "البدرشين",
      "الصف",
      "أطفيح",
      "كرداسة",
      "منشأة القناطر",
      "أوسيم",
      "أبو النمرس",
      "الحوامدية"
    ],
    "الإسكندرية": [
      "المنتزه",
      "الرمل",
      "سيدي جابر",
      "وسط",
      "العجمي",
      "العامرية",
      "برج العرب",
      "الجمرك",
      "شرق"
    ],
    "البحيرة": [
      "دمنهور",
      "كفر الدوار",
      "رشيد",
      "إدكو",
      "أبو حمص",
      "المحمودية",
      "الرحمانية",
      "شبراخيت",
      "كوم حمادة",
      "إيتاي البارود",
      "الدلنجات",
      "حوش عيسى",
      "بدر",
      "وادي النطرون"
    ],
    "الشرقية": [
      "الزقازيق",
      "بلبيس",
      "أبو حماد",
      "منيا القمح",
      "فاقوس",
      "الحسينية",
      "ديرب نجم",
      "الإبراهيمية",
      "ههيا",
      "كفر صقر",
      "أولاد صقر",
      "أبو كبير",
      "صان الحجر",
      "القنايات"
    ],
    "الدقهلية": [
      "المنصورة",
      "طلخا",
      "ميت غمر",
      "السنبلاوين",
      "دكرنس",
      "أجا",
      "شربين",
      "المطرية",
      "بلقاس",
      "نبروه",
      "بني عبيد",
      "المنزلة",
      "ميت سلسيل"
    ],
    "الغربية": [
      "طنطا",
      "المحلة الكبرى",
      "سمنود",
      "زفتى",
      "قطور",
      "بسيون",
      "كفر الزيات",
      "السنطة"
    ],
    "المنوفية": [
      "شبين كوم",
      "ومنوف",
      "مدينة السادات",
      "اشمون",
      "وسرس الليان",
      "الباجور",
      "وقويسنا",
      "بركة السبع",
      "وتلا",
      "الشهداء"
    ],
    "بورسعيد": [
      "دليل حى شرق",
      "دليل حى غرب",
      "دليل العرب",
      "دليل حى الضواحى",
      "دليل بور فواد",
      "دليل حى الزهور",
      "دليل المنطقة االحرة",
      "دليل بور توفيق",
      "دليل حى مبارك",
      "دليل جنوب بورسعيد",
      "دليل حى فرج"
    ],
    "القليوبيه": [
      "بنها",
      "قليوب",
      "القناطر الخيريه",
      "شبرا الخيمه",
      "الخانكة",
      "كفر شكر",
      "شبين القناطر",
      "طوخ",
      "العبور",
      "قها",
      "الخصوص"
    ],
    "كفر الشيخ": [
      "دسوق",
      "سيدى سالم",
      "فوه",
      "مطوبس",
      "كفر الشيخ",
      "سيدى غازى",
      "مسير",
      "بيلا",
      "بلطيم",
      "الحامول",
      "الرياض",
      "قلين",
      "برج البرلس"
    ],
    "مرسى مطروح": [
      "الحمام",
      "العلمين",
      "الضبعه",
      "مرسى مطروح",
      "النجيلة",
      "سيدى برانى",
      "السلوم",
      "سيوة"
    ],
    "دمياط": ["فارسكو", "دمياط", "كفر السعد", "الزرقا", "كفر البطيخ"],
    "السويس": ["الأربعين", "الجزيرة الخضراء", "الجناين", "الشط", "العين"]
  };

  static getAllCities() {
    List<String> keys = [];
    for (var key in _cities.keys) {
      keys.add(key);
    }
    return keys;
  }

  static getGov({
    required String city,
  }) {
    return _cities[city];
  }

  List<String> _specialists = [
    "Obstetrics",
    "Teeth",
    "Urology",
    "Lung",
    "Pediatrics",
    "Psychiatry",
    "Ear, Nose & Throat (ENT)",
    "Dermatology",
    "Orthopedics",
    "Eye",
    "Heart",
    "Nutritionist",
    "Family Medicine & Allergy",
    "Orthopedic",
    "Gastroenterology",
    "Internal Medicine",
    "Surgery",
    "Acupuncture",
    "Vascular Surgery",
    "Nephrology",
    "Radiology",
    "Endocrinology",
    "Genetics",
    "Speech Therapy",
    "Pain Management",
    "Cosmetic Surgery"
  ];

  static handleSlots(String workingFrom) {
    List<String> timeSlots = [];
    int index = _allSlots.indexOf(workingFrom);
    for (var i = index; i < _allSlots.length; i++) {
      timeSlots.add(_allSlots[i]);
    }
    return timeSlots;
  }
}
